Tekla.Structures.Model.Phase
The Phase class defines a model object phase.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Point Point1 = new Point(4000, 4000, 0);
Point Point2 = new Point(7000, 4000, 0);
Point Point3 = new Point(4000, 6000, 0);
Point Point4 = new Point(7000, 6000, 0);
Beam Beam1 = new Beam(Point1, Point2);
Beam Beam2 = new Beam(Point3, Point4);
Beam1.Profile.ProfileString = "HEA400";
Beam1.Finish = "PAINT";
Beam2.Profile.ProfileString = "HEA400";
Beam2.Finish = "PAINT";
Beam1.Insert();
Beam2.Insert();
Phase Beam1Phase = new Phase();
Beam1.GetPhase(out Beam1Phase);
int PhaseNumber = Beam1Phase.PhaseNumber;
string PhaseName = Beam1Phase.PhaseName;
string PhaseComment = Beam1Phase.PhaseComment;
Phase Beam2Phase = new Phase();
Beam2.GetPhase(out Beam2Phase);
if(Beam1Phase.PhaseNumber != Beam2Phase.PhaseNumber)
{
if(Convert.ToBoolean(Beam1Phase.IsCurrentPhase))
Beam2.SetPhase(Beam1Phase);
else
Beam1.SetPhase(Beam2Phase);
}
}
}

Tekla.Structures.Model.Phase._IsCurrentPhase
Is current phase or not.

Tekla.Structures.Model.Phase.PhaseNumber
The phase number.

Tekla.Structures.Model.Phase.PhaseName
The phase name.

Tekla.Structures.Model.Phase.PhaseComment
The phase comment.

Tekla.Structures.Model.Phase.IsCurrentPhase
The value is 1 if the phase is the current phase, 0 otherwise.

Tekla.Structures.Model.Phase.#ctor
Instantiates a new phase with the phase number 0.

Tekla.Structures.Model.Phase.#ctor(System.Int32)
Instantiates a new phase with the given phase number.
PhaseNumber: The number of the phase.

Tekla.Structures.Model.Phase.#ctor(System.Int32,System.String,System.String,System.Int32)
Instantiates a new phase with the given parameters.
PhaseNumber: The number of the phase.
PhaseName: The name of the phase.
PhaseComment: The comment of the phase.
IsCurrentPhase: The value is 1 if the phase is the current phase, 0 otherwise.

Tekla.Structures.Model.Phase.Insert
Creates a new phase.
Returns: True on success, false if failed (the reason for the failure is probably that
the phase number already exists).

Tekla.Structures.Model.Phase.Select
Selects a phase.
Returns: True on success, false if failed (PhaseNumber should be higher than 0).

Tekla.Structures.Model.Phase.Modify
Modifies a phase.
Returns: True on success, false if failed (PhaseNumber should be higher than 0).

Tekla.Structures.Model.Phase.Delete
Deletes a phase. The current phase cannot be deleted.
Returns: True on success, false if failed (the attached objects probably caused the failure).

Tekla.Structures.Model.Phase.SetUserProperty(System.String,System.String)
Sets a string property for the phase.
Name: The name of the property to be set, in capital letters.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.Phase.SetUserProperty(System.String,System.Double)
Sets a double property for the phase.
Name: The name of the property to be set, in capital letters.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.Phase.SetUserProperty(System.String,System.Int32)
Sets an integer property for the phase.
Name: The name of the property to be set, in capital letters.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.Phase.GetUserProperty(System.String,System.String@)
Retrieves a string property for the phase.
Name: The name of the property to be retrieved, in capital letters.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.Phase.GetUserProperty(System.String,System.Double@)
Retrieves a double property for the phase.
Name: The name of the property to be retrieved, in capital letters.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.Phase.GetUserProperty(System.String,System.Int32@)
Retrieves an integer property for the phase.
Name: The name of the property to be retrieved, in capital letters.
Value: The return value.
Returns: True if the value was returned successfully.